CREATE TABLE students (
    id SERIAL PRIMARY KEY,
    last_name VARCHAR(50),
    first_name VARCHAR(50),
    patronymic VARCHAR(50),
    course INTEGER,
    "group" VARCHAR(20),
    faculty VARCHAR(100)
);

INSERT INTO students (last_name, first_name, patronymic, course, "group", faculty) VALUES
('Брель', 'Мария', 'Владимировна', 2, 'P3207', 'Программной инженерии и компьютерной техники'),
('Лучко', 'Олег', 'Михайлович', 2, 'U3275', 'Технологического менеджмента и инноваций'),
('Климов', 'Даниил', 'Андреевич', 3, 'Z3344', 'Физический'),
('Тутов', 'Артем', 'Олегович', 1, 'J4133', 'Технологий искусственного интелекта'),
('Некрасова', 'Анна', 'Алексеевна', 1, 'O4150','НОЦ инфохимии'),
('Прохорова', 'Екатерина', 'Владимировна', 4, 'T34311', 'Биотехнологий'),
('Руденко', 'Дарья', 'Алексеевна', 4, 'N34451', 'Безопасности информационных технологий');